## 1. Import Library
Pada Tahap ini kita akan import library yang dibutuhkan

In [128]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, StandardScaler

## 2. Dowload dan Load Dataset
Mendowload Dataset dari Kaggle,
Lalu memasukkan dataset yang ingin diolah

Di sini kita akan load file CSV, melihat 10 baris pertama, melihat informasi kolom, dan menghitung missing value.

- `pd.read_csv()` — membaca file CSV dan mengembalikan `DataFrame`.
- `df.head(n)` — menampilkan n baris pertama.
- `df.info()` — menampilkan tipe data dan jumlah non-null per kolom.
- `df.isnull().sum()` — menghitung jumlah missing value per kolom.

In [149]:
df = pd.read_csv("dataset_contoh.csv")
print(df)
df.head()

      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    karachi    Finance  125917.01    ahmed48gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com
19   tariq    Male   NaN     Lahore        HR         NaN   tariq76@gmail.com

     Name  Gender   Age     City Department     Salary               Email
0   Tariq    Male  47.0  Karachi     Sales   123609.72   tariq76@gmail.com
1    Hina  Female  26.0   Quetta         HR  125683.94    hina90@gmail.com
2   Usman    Male  36.0   lahore     Sales         NaN   usman71@gmail.com
3    Sana  Female  21.0   Quetta    Finance  147901.41    sana72@gmail.com
4  Ayesha    Male  40.0   lahore         HR  123880.80  ayesha25@gmail.com

In [150]:
print('=== Preview (first 10 rows) ===')
display(df.head(10))

print('\n=== Info ===')
df.info()

print('\n=== Missing values per column ===')
print(df.isnull().sum())

print('\n=== Numeric summary ===')
display(df.describe(include='number').T)

=== Preview (first 10 rows) ===

     Name  Gender   Age       City Department     Salary               Email
0   Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1    Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2   Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3    Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4  Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5   Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6   Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7   Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8   Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9    Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com

=== Info ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Gender      20 non-null     object
 2   Age         7 non-null      float64
 3   City        20 non-null     object
 4   Department  20 non-null     object
 5   Salary      14 non-null     float64
 6   Email       20 non-null     object
dtypes: float64(2), object(5)
memory usage: 1.2+ KB

=== Missing values per column ===
Name           0
Gender         0
Age           13
City           0
Department     0
Salary         6
Email          0
dtype: int64

=== Numeric summary ===

,count,mean,std,min,25%,50%,75%,max
Age,7.0,39.857143,13.557637,21.00,31.000,40.000,48.00,60.00
Salary,14.0,105991.486429,43246.375835,32984.18,68489.205,125800.475,131163.24,149944.07

<!-- 3. EDA -->

## 3. Data Cleaning
Tahapan ini bertujuan untuk memperbaiki kualitas data dengan melakukan beberapa proses:
1. Hapus data duplikat
2. Cek dan tangani missing value
3. Perbaikan format penulisan huruf pada kolom teks
4. Validasi format Email
5. Menangani outlier pada kolom Salary

## a.) Menghapus Duplikat

In [151]:
print("\n=== Jumlah Data Sebelum Menghapus Duplikat ===")
print(len(df))
# df = pd.read_csv("dataset_contoh.csv")
# print(df)   

# Hapus duplikat berdasarkan Email (asumsi Email adalah unique identifier)
df = df.drop_duplicates(subset=["Email"], keep="first")

print("\n=== Jumlah Data Sesudah Menghapus Duplikat ===")
print(len(df))
print(df)

=== Jumlah Data Sebelum Menghapus Duplikat ===
20

=== Jumlah Data Sesudah Menghapus Duplikat ===
19
      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    karachi    Finance  125917.01    ahmed48gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com

## b.) Menangani Missing Values
Strategi sederhana:
1. Numerik -> isi dengan median
2. Kategorikal -> isi dengan mode
3. Drop kolom dengan >50% missing

In [152]:
print("\n=== Missing Value Sebelum Dibersihkan ===")
print(df.isnull().sum())
# df = pd.read_csv("dataset_contoh.csv")
# print(df)

# Mengisi missing numerik dengan median
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Salary"] = df["Salary"].fillna(df["Salary"].median())

# Mengisi missing kategorikal dengan mode
df["Name"] = df["Name"].fillna(df["Name"].mode()[0])
df["Gender"] = df["Gender"].fillna(df["Gender"].mode()[0])
df["City"] = df["City"].fillna(df["City"].mode()[0])
df["Department"] = df["Department"].fillna(df["Department"].mode()[0])

print("\n=== Missing Value Sesudah Dibersihkan ===")
print(df.isnull().sum())
print(df)

=== Missing Value Sebelum Dibersihkan ===
Name           0
Gender         0
Age           12
City           0
Department     0
Salary         5
Email          0
dtype: int64

=== Missing Value Sesudah Dibersihkan ===
Name          0
Gender        0
Age           0
City          0
Department    0
Salary        0
Email         0
dtype: int64
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.940    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         IT  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
10   Ahmed  Female  40.0    karachi    Finance  125917.010    ahmed48gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         HR  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         IT  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         IT  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         HR  125800.475    sara96@gmail.com

## c.) Perbaikan Format Teks (konsistansi kapital)

In [153]:
# print("\n=== Data Sebelum Format Huruf Dibenahi ===")
# df = pd.read_csv("dataset_contoh.csv")  
# print(df)   

df["Name"] = df["Name"].str.title()
df["City"] = df["City"].str.title()
df["Department"] = df["Department"].str.title()

print("\n=== Data Setelah Format Huruf Dibenahi ===")
print(df)

=== Data Setelah Format Huruf Dibenahi ===
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
10   Ahmed  Female  40.0    Karachi    Finance  125917.010    ahmed48gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         It  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

## d.) Validasi Email

In [154]:
print("\n=== Jumlah Data Sebelum Validasi Email ===")
print(len(df))

df = df[df["Email"].str.contains("@", na=False)]

print("\n=== Jumlah Data Sesudah Validasi Email ===")
print(len(df))
print(df)

=== Jumlah Data Sebelum Validasi Email ===
19

=== Jumlah Data Sesudah Validasi Email ===
18
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         It  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

## e.) Menghapus Outlier Salary

In [156]:
print("\n=== Range Salary Sebelum Outlier Dihapus ===")
print(df["Salary"].describe())

Q1 = df["Salary"].quantile(0.25)
Q3 = df["Salary"].quantile(0.75)
print("Q1 (Quartile 1) =", Q1)
print("Q3 (Quartile 3) =", Q3)

IQR = Q3 - Q1
low = Q1 - (1.5 * IQR)
high = Q3 + (1.5 * IQR)


df = df[(df["Salary"] >= low) & (df["Salary"] <= high)]

print("\n=== Range Salary Sesudah Outlier Dihapus ===")
print(df["Salary"].describe())
print(df)
print("\nBatas bawah (low) =", low)
print("Batas atas (high) =", high)

=== Range Salary Sebelum Outlier Dihapus ===
count        12.000000
mean     126945.914583
std        3032.124813
min      123609.720000
25%      125771.341250
50%      125800.475000
75%      127503.240000
max      133554.550000
Name: Salary, dtype: float64
Q1 (Quartile 1) = 125771.34125
Q3 (Quartile 3) = 127503.23999999999

=== Range Salary Sesudah Outlier Dihapus ===
count        10.000000
mean     125764.305500
std        1348.988735
min      123609.720000
25%      125713.073750
50%      125800.475000
75%      125800.475000
max      128192.850000
Name: Salary, dtype: float64
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

Batas bawah (low) = 123173.49312500001
Batas atas (high) = 130101.08812499998

## f.) Data Bersih

In [157]:
print("\n=== DATA BERSIH FINAL ===")
print(df)

=== DATA BERSIH FINAL ===
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com